app/views/admin/notifications/_counter.html.erb


<%= counter = Notification.where(:status => 0).size%>
---
SELECT COUNT(*) FROM `notifications` WHERE `notifications`.`status` = 0