app/views/dashboard/funnel_list.html.erb

SELECT COUNT(*) FROM `pages` WHERE `pages`.`funnel_id` = 134
---
      <td><%=funnel.user.email? ? funnel.user.email : "No records found"%></td>
      <td><%=funnel.pages.size%></td>