app/controllers/admin/funnels_controller.rb

  def index

    @text = params[:id]
  if @text==nil
    @funnels = Funnel.all
  else
    @funnels = Funnel.where(user_id:params[:id])
---
SELECT `funnels`.* FROM `funnels`
SELECT `funnels`.* FROM `funnels` WHERE `funnels`.`user_id` = 8

    def set_funnel
      @funnel = Funnel.find(params[:id])
---
SELECT  `funnels`.* FROM `funnels` WHERE `funnels`.`id` = 1 LIMIT 1