app/controllers/admin/notifications_controller.rb

SELECT `notifications`.* FROM `notifications`
---
    def index
        @notifications = Notification.all

SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 7 LIMIT 1
UPDATE `notifications` SET `status` = 1, `updated_at` = '2020-05-26 13:40:08' WHERE `notifications`.`id` = 11
SELECT COUNT(*) FROM `notifications` WHERE `notifications`.`status` = 0
---
    def update
        @notification = Notification.find(params[:id])
        @notification.status = 1
        if @notification.save
            @count = Notification.where(status: 0).size

SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 7 LIMIT 1
DELETE FROM `notifications` WHERE `notifications`.`id` = 7
SELECT COUNT(*) FROM `notifications` WHERE `notifications`.`status` = 0
---
    def destroy
        @notification = Notification.find(params[:id])
        @notification.status = 1
        if @notification.destroy
            @count = Notification.where(status: 0).size