app/controllers/admin/pages_controller.rb

SELECT `pages`.* FROM `pages` WHERE `pages`.`funnel_id` = 1
---
  def show
    @pages = Page.where(funnel_id: params[:id])