app/controllers/admin/reports_controller.rb

  def index
    Funnel.where(user_id: current_user.id).limit(1).each do |funnel|
      @pages = Page.where(funnel_id: funnel.id)
---
SELECT  `funnels`.* FROM `funnels` WHERE `funnels`.`user_id` = 27 LIMIT 1
SELECT `pages`.* FROM `pages` WHERE `pages`.`funnel_id` = 134

  def show
    PageForm.where(page_id: params[:id]).limit(1).each do |form|
    @headings = PageColumn.where(page_form_id: form.id)
---
SELECT  `page_forms`.* FROM `page_forms` WHERE `page_forms`.`page_id` = 175 LIMIT 1
SELECT `page_columns`.* FROM `page_columns` WHERE `page_columns`.`page_form_id` = 2