app/controllers/admin/session_controller.rb

  def login
    @user = User.find_by_email(session_params[:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'test12@gmail.com' LIMIT 1