app/controllers/admin/statics_controller.rb

SELECT  `static_pages`.* FROM `static_pages` WHERE `static_pages`.`user_id` = 1 LIMIT 1
UPDATE `static_pages` SET `faq` = 'update' WHERE `static_pages`.`id` = 6
UPDATE `static_pages` SET `contact_us` = 'contactb us for more details' WHERE `static_pages`.`id` = 6
UPDATE `static_pages` SET `privacypolicy` = NULL WHERE `static_pages`.`id` = 6
INSERT INTO `static_pages` (`tc`, `user_id`) VALUES ('<p>just check</p>', 1)
---
  def create

    @type=params[:field]
    if @type == "faq"
      @data = StaticPage.find_by(user_id:session[:user_id]).update_column(:faq , params[:tc])
      @stactics = StaticPage.new

      @content= "FAQ"
      redirect_to request.referrer,notice: 'FAQ Successfully Added'

      # render :showfaq
      return

    end
    if @type=="tc"
      @check=StaticPage.find_by(user_id:session[:user_id])
      if(@check)
      @data = StaticPage.find_by(user_id:session[:user_id]).update_column(:tc , params[:tc])
      else
        @data= StaticPage.new(user_id:session[:user_id],tc:params[:tc])
    @data.save!

SELECT  `static_pages`.* FROM `static_pages` WHERE `static_pages`.`user_id` = 1 LIMIT 1
UPDATE `static_pages` SET `contact_us` = '<p>again test</p>' WHERE `static_pages`.`id` = 6
---
    end
    if @type=="privacy"

      @data = StaticPage.find_by(user_id:session[:user_id]).update_column(:privacypolicy , params[:tc])