app/controllers/admin/users_controller.rb

SELECT  `user_details`.* FROM `user_details` WHERE `user_details`.`user_id` = 8 LIMIT 1
---
    def edit
      @user_detail = UserDetail.find_by_user_id(params[:id])