app/controllers/api/v1/base_controller.rb

    def auth_request
        header = request.headers['Authorization']
        if !header.blank?
          begin
            @user = User.find_by(token: header)
---
SELECT  `users`.* FROM `users` WHERE `users`.`token` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VyIjoiIzxVc2VyOjB4MDAwMDdmNGY2ODRkMDZlOD4iLCJleHAiOjE1ODMzMDY4MjZ9.90ekFW4-x9JwYNf7kN6MBkNu3FygtXsJn3SMM9sPSds' LIMIT 1