app/controllers/api/v1/funnels_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 27 LIMIT 1
---
def check_user

    @data_a = User.find(@user.id)

INSERT INTO `pages` (`funnel_id`, `created_at`, `updated_at`, `name`, `description`, `title`) VALUES (134, '2020-05-29 06:31:29', '2020-05-29 06:31:29', 'new at 12:01 case', 'page description at 4:20 case', 'page title at tset case')
INSERT INTO `funnels` (`user_id`, `name`, `created_at`, `updated_at`) VALUES (27, 'new  29may20 at 4:2101 case', '2020-05-29 06:31:29', '2020-05-29 06:31:29')
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 2281 LIMIT 1
---
    def create
        if !page_params[:funnel_id].present?
            @funnel = Funnel.new(user_id: @@current_user.id,name: page_params[:funnel_name])
            @funnel.save!
            @funnel_id = @funnel.id
            funnel_exists = true
        else
            if  Funnel.exists?(id: page_params[:funnel_id])
                @funnel_id = page_params[:funnel_id]
            else
                funnel_exists = false
            end
        end

        if !page_params[:page_id].present?
            @page = Page.new(funnel_id: @funnel_id,name: page_params[:page_name],background: page_params[:background],description: page_params[:description],title: page_params[:title])
            @page.save!
            page_id = @page.id
            page_exists = true
        else
            if funnel_exists != false
                if Page.exists?(id: page_params[:page_id])
                    if Page.exists?(funnel_id: page_params[:funnel_id],id: page_params[:page_id])
                        page_id = page_params[:page_id]
                        @sections = Section.where(page_id: page_id)
                        if @sections != nil
                            @sections.each do |section|

INSERT INTO `sections` (`page_id`, `created_at`, `updated_at`) VALUES (175, '2020-05-29 06:31:30', '2020-05-29 06:31:30')
INSERT INTO `styles` (`section_id`, `style`, `value`, `created_at`, `updated_at`) VALUES (2281, 'text-align', 'center', '2020-05-29 06:31:30', '2020-05-29 06:31:30')
---
                if relation_exists != false
                    element_params[:sections].each do |element|
                        @page_section = Section.new(page_id: page_id)
                        if @page_section.save!
                            if element[:styles].present?
                                element[:styles].each do |key,value|
                                    @style = Style.new(section_id: @page_section.id,style: key,value: value)
                                    @style.save!

INSERT INTO `sec_attributes` (`section_id`, `attri`, `value`, `created_at`, `updated_at`) VALUES (2281, 'class', 'section', '2020-05-29 06:31:30', '2020-05-29 06:31:30')
---
                            if element[:attributes].present?
                                element[:attributes].each do |key,value|
                                    @style = SecAttribute.new(section_id: @page_section.id,attri: key,value: value)
                                    @style.save!

INSERT INTO `containers` (`section_id`, `created_at`, `updated_at`) VALUES (2281, '2020-05-29 06:31:30', '2020-05-29 06:31:30')
INSERT INTO `styles` (`container_id`, `style`, `value`, `created_at`, `updated_at`) VALUES (2282, 'background', 'green', '2020-05-29 06:31:30', '2020-05-29 06:31:30')
---
                            end
                            element[:containers].each do |container|
                                @page_container = Container.new(section_id: @page_section.id)
                                if @page_container.save!
                                    if container[:styles].present?
                                        container[:styles].each do |key,value|
                                            @style = Style.new(container_id: @page_container.id,style: key,value: value)
                                            @style.save!

INSERT INTO `sec_attributes` (`container_id`, `attri`, `value`, `created_at`, `updated_at`) VALUES (2282, 'class', 'container', '2020-05-29 06:31:30', '2020-05-29 06:31:30')
---
                                    if container[:attributes].present?
                                        container[:attributes].each do |key,value|
                                            @style = SecAttribute.new(container_id: @page_container.id,attri: key,value: value)
                                            @style.save!

INSERT INTO `rows` (`container_id`, `created_at`, `updated_at`) VALUES (2282, '2020-05-29 06:31:30', '2020-05-29 06:31:30')
INSERT INTO `styles` (`row_id`, `style`, `value`, `created_at`, `updated_at`) VALUES (2447, 'text-align', 'center', '2020-05-29 06:31:31', '2020-05-29 06:31:31')
---
                                    end
                                    container[:rows].each do |row|
                                        @page_row = Row.new(container_id: @page_container.id)
                                        if @page_row.save!
                                            if row[:styles].present?
                                                row[:styles].each do |key,value|
                                                    @style = Style.new(row_id: @page_row.id,style: key,value: value)
                                                    @style.save!

INSERT INTO `sec_attributes` (`row_id`, `attri`, `value`, `created_at`, `updated_at`) VALUES (2447, 'class', 'row', '2020-05-29 06:31:31', '2020-05-29 06:31:31')
---
                                            if row[:attributes].present?
                                                row[:attributes].each do |key,value|
                                                    @style = SecAttribute.new(row_id: @page_row.id,attri: key,value: value)
                                                    @style.save!

INSERT INTO `columns` (`row_id`, `created_at`, `updated_at`) VALUES (2447, '2020-05-29 06:31:31', '2020-05-29 06:31:31')
INSERT INTO `styles` (`column_id`, `style`, `value`, `created_at`, `updated_at`) VALUES (4197, 'background', 'black', '2020-05-29 06:31:31', '2020-05-29 06:31:31')
---
                                            end
                                            row[:columns].each do |column|
                                                @page_col = Column.new(row_id: @page_row.id)
                                                if @page_col.save!
                                                    if column[:styles].present?
                                                        column[:styles].each do |key,value|
                                                            @style = Style.new(column_id: @page_col.id,style: key,value: value)
                                                            @style.save!

INSERT INTO `sec_attributes` (`column_id`, `attri`, `value`, `created_at`, `updated_at`) VALUES (4197, 'class', 'col-lg-12', '2020-05-29 06:31:31', '2020-05-29 06:31:31')
---
                                                    if column[:attributes].present?
                                                        column[:attributes].each do |key,value|
                                                            @style = SecAttribute.new(column_id: @page_col.id,attri: key,value: value)
                                                            @style.save!

INSERT INTO `page_elements` (`field`, `value`, `created_at`, `updated_at`, `column_id`) VALUES ('paynow', '2', '2020-05-29 06:31:31', '2020-05-29 06:31:31', 4197)
---
                                                        #    @pagefind= @id.find(field["value"])
                                                           if @popup == "true"
                                                            @p_element = PageElement.new(column_id: @page_col.id,field: field["field"],value: field["value"])
                                                            @p_element.save!

INSERT INTO `page_elements` (`field`, `value`, `created_at`, `updated_at`, `column_id`) VALUES ('paynow', '2', '2020-05-29 06:31:31', '2020-05-29 06:31:31', 4197)
---
                                                           end
                                                        else
                                                            @p_element = PageElement.new(column_id: @page_col.id,field: field["field"],value: field["value"])
                                                            @p_element.save!

INSERT INTO `element_styles` (`page_element_id`, `style`, `value`, `created_at`, `updated_at`) VALUES (10251, 'line-height', '40px', '2020-05-29 06:31:31', '2020-05-29 06:31:31')
---
                                                        if field[:styles].present?
                                                            field[:styles].each do |key,value|
                                                                @style = ElementStyle.new(page_element_id: @p_element.id,style: key,value: value)
                                                                @style.save!

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 175 LIMIT 1
---
                      end
                   end
                    begin
                        page = Page.find(page_id)

SELECT  `funnels`.* FROM `funnels` WHERE `funnels`.`id` = 134 LIMIT 1
---
    def set_funnel
        begin
            @funnel = Funnel.find(params[:id])