app/controllers/api/v1/pages_controller.rb

SELECT  `static_pages`.* FROM `static_pages` WHERE `static_pages`.`user_id` = 17 LIMIT 1
---
    def show_static_page

        @Static_page = StaticPage.find_by(user_id: @@current_user.id)