app/views/admin/funnels/index.html.erb

              <td><%=funnel.user.email? ? funnel.user.email : "No records found"%></td>
              <td><%=funnel.pages.size%></td>
---
SELECT COUNT(*) FROM `pages` WHERE `pages`.`funnel_id` = 1