app/views/admin/funnels/show.html.erb

          <tr>
            <td data-column="Number of Pages:"><%=@funnel.pages.count%> </td>
---
SELECT COUNT(*) FROM `pages` WHERE `pages`.`funnel_id` = 1