app/views/funnels/_img.html.erb


<%@attributes = ElementAttribute.where(page_element_id: element.id)%>
<%@styles = ElementStyle.where(page_element_id: element.id)%>
---
SELECT `element_attributes`.* FROM `element_attributes` WHERE `element_attributes`.`page_element_id` = 504
SELECT `element_styles`.* FROM `element_styles` WHERE `element_styles`.`page_element_id` = 505