app/views/funnels/_input.html.erb

SELECT `element_attributes`.* FROM `element_attributes` WHERE `element_attributes`.`page_element_id` = 6873
SELECT `element_styles`.* FROM `element_styles` WHERE `element_styles`.`page_element_id` = 507
---
<div class="form-group">
<%@attributes = ElementAttribute.where(page_element_id: element.id)%>
<%@styles = ElementStyle.where(page_element_id: element.id)%>