app/views/funnels/show_funnel.html.erb

    <%@sections.each do |section|%>
        <section <% SecAttribute.where(section_id: section.id).each do |att|%><%=att.attri%>="<%=att.value%>" <%end%> style="<% Style.where(section_id: section.id).each do |style|%><%=style.style%>:<%=style.value%>; <%end%>">
            <%Container.where(section_id: section.id).each do |container|%>
                <div <% SecAttribute.where(container_id: container.id).each do |att|%><%=att.attri%>="<%=att.value%>" <%end%> style="<% Style.where(container_id: container.id).each do |style|%><%=style.style%>:<%=style.value%>; <%end%>">
                    <%Row.where(container_id: container.id).each do |row|%>
                        <div <% SecAttribute.where(row_id: row.id).each do |att|%><%=att.attri%>="<%=att.value%>" <%end%> style="<% Style.where(row_id: row.id).each do |style|%><%=style.style%>:<%=style.value%>; <%end%>">
                            <%Column.where(row_id: row.id).each do |col|%>
                                <div <% SecAttribute.where(column_id: col.id).each do |att|%><%=att.attri%>="<%=att.value%>" <%end%> style="<% Style.where(column_id: col.id).each do |style|%><%=style.style%>:<%=style.value%>; <%end%>">
                                    <%PageElement.where(column_id: col.id).each do |element|%>
---
SELECT `sec_attributes`.* FROM `sec_attributes` WHERE `sec_attributes`.`section_id` = 2281
SELECT `styles`.* FROM `styles` WHERE `styles`.`section_id` = 2281
SELECT `containers`.* FROM `containers` WHERE `containers`.`section_id` = 2281
SELECT `sec_attributes`.* FROM `sec_attributes` WHERE `sec_attributes`.`container_id` = 2282
SELECT `styles`.* FROM `styles` WHERE `styles`.`container_id` = 2282
SELECT `rows`.* FROM `rows` WHERE `rows`.`container_id` = 2282
SELECT `sec_attributes`.* FROM `sec_attributes` WHERE `sec_attributes`.`row_id` = 2447
SELECT `styles`.* FROM `styles` WHERE `styles`.`row_id` = 2447
SELECT `columns`.* FROM `columns` WHERE `columns`.`row_id` = 2447
SELECT `sec_attributes`.* FROM `sec_attributes` WHERE `sec_attributes`.`column_id` = 4197
SELECT `styles`.* FROM `styles` WHERE `styles`.`column_id` = 4197
SELECT `page_elements`.* FROM `page_elements` WHERE `page_elements`.`column_id` = 4197