app/views/admin/reports/show.html.erb

                        <tr>
                            <%PageColumn.where(page_form_id: form.id).each do |heading|%>
---
SELECT `page_columns`.* FROM `page_columns` WHERE `page_columns`.`page_form_id` = 2