app/controllers/dashboard_controller.rb

  def index

    if session[:user_id].present?
    @user1 = User.find(session[:user_id])
    end
    #@user = Funnel.find_by(user_id:session[:user_id]).All
    @funnels = Funnel.where(user_id:session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 27 LIMIT 1
SELECT  `funnels`.* FROM `funnels` WHERE `funnels`.`user_id` = 27 LIMIT 1

def show_page

  @pages = Page.where(funnel_id: params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`funnel_id` IS NULL