app/controllers/funnels_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 159 LIMIT 1
UPDATE `page_views` SET `no_of_view` = 2 WHERE `page_views`.`id` = 7
UPDATE `pages` SET `view` = 1 WHERE `pages`.`id` = 159
SELECT  `page_views`.* FROM `page_views` WHERE `page_views`.`page_id` = 157 LIMIT 1
SELECT  `page_views`.* FROM `page_views` WHERE `page_views`.`page_id` = 159 LIMIT 1  [["page_id", 159], ["LIMIT", 1]]
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = NULL LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`page_id` = 175
---
  def show_funnel
    begin
    @view = Page.find(params[:id])
    @view_p=@view.view
    @page_v="ok"
    rescue
    @page_v="not_ok"
    end

if @page_v == "not_ok"
  #@page_view = PageView.new(page_id:params[:id] ,no_of_view:"1")
 # @page_view.save!
 @data = Page.find(params[:id]).update_column(:view , @view_p+1)
else
  @data = Page.find(params[:id]).update_column(:view , @view_p+1)

    # @page_view = PageView.(page_id:params[:id] ,no_of_view:@view_p+1)
    # @page_view.save!
end
    @page = Page.find(params[:id])
    @sections = Section.where(page_id: params[:id])