app/controllers/home_controller.rb

  def index

    if session[:user_id].present?
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 27 LIMIT 1