app/controllers/stripe_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
def payment_gateway

  @user = User.find(session[:user_id])

SELECT  `cards`.* FROM `cards` WHERE `cards`.`user_id` = 27 LIMIT 1
---
def save_card
  @flag=""
  if session[:user_id].present?
    begin
    @user = Card.find_by(user_id:session[:user_id])

SELECT  `cards`.* FROM `cards` WHERE `cards`.`user_id` = 27 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 27 LIMIT 1
---
def carddetailsave
  @error = nil
  Stripe.api_key = 'sk_test_BMHo4P2D81el6tcJ88K8ureu005fondgSO'
  @data_ab = params[:id]
  @last4 = params[:last4]
  @tok_id = params[:tok_id]
  @usr_id = session[:user_id]
  @user = Card.find_by(user_id:session[:user_id]) #update card

begin
@user_card_id = @user.id
rescue
@error = "error"
end
@user_tb = User.find(session[:user_id])

INSERT INTO `cards` (`user_id`, `customer_id`, `last_digit`) VALUES (27, 'cus_HLji1VIY5Ir98B', 4242)
---


@data = Card.new(user_id:@usr_id, customer_id:@cus_id, last_digit:@last4)
@data.save!

SELECT  `cards`.* FROM `cards` WHERE `cards`.`user_id` = 27 LIMIT 1
DELETE FROM `cards` WHERE `cards`.`id` = 14
---
def deletecard

  @user = Card.find_by(user_id:session[:user_id]) #update card

  Stripe::Customer.delete(@user.customer_id)
  @user.destroy