app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
        @user.create_user_detail!
---
INSERT INTO `users` (`f_name`, `l_name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('aryan', 'rai', 'aryan03@gmail.com', '$2a$12$cfBqbjr.cC98BL.nGWqOXuSAPESkcdFVtqCEaJB2EOgPhT1wYpbyK', '2020-05-26 13:39:02', '2020-05-26 13:39:02')
INSERT INTO `user_details` (`user_id`, `created_at`, `updated_at`) VALUES (29, '2020-05-26 13:39:02', '2020-05-26 13:39:02')