app/models/user.rb

INSERT INTO `notifications` (`user_id`, `event`, `status`, `created_at`, `updated_at`) VALUES (29, 'New User aryan rai', 0, '2020-05-26 13:39:02', '2020-05-26 13:39:02')
---
  def notify
    Notification.create(event: "New User #{self.f_name} #{self.l_name}",user_id: self.id ,status: 0)