app/views/admin/users/index.html.erb

                                    <td><%= user.email? ? user.email : "No records found" %></td>
                                    <td><a href="<%= admin_funnels_path(id:user.id) %>"><%=user.funnels.count%></a></td>
---
SELECT `users`.* FROM `users`
SELECT COUNT(*) FROM `funnels` WHERE `funnels`.`user_id` = 3