app/views/layouts/_admin_header.html.erb

        <ul class="nav navbar-nav navbar-right">
            <li><a href="<%=admin_notifications_path%>"><i class="fa fa-bell-o" aria-hidden="true"></i><span class="notify-counter" id="counter" ><%=Notification.where(status: 0).size%></span></a></li>
---
SELECT COUNT(*) FROM `notifications` WHERE `notifications`.`status` = 0